1、什么是汇编语言：汇编语言是一种最接近计算机核心的编码语言。不同于任何高级语言，汇编语言几乎可以完全和机器语言一一对应。
2、汇编语言就是机器语言的一种可以被人读懂的形式，只不过它更容易记忆。
3、汇编语言被编译成机器语言之后，将有处理器（CPU）来执行。
寄存器位于CPU中，可以保存特定长度的数据。某些寄存器中保存的数据对于系统的运行有特殊的意义。
4、寄存器可以被装入数据，你可以在不同寄存器之间移动这些数据，或者做类似的事情，如四则运算、位运算等操作。
5、通用寄存器的名称和习惯用法:
EAX
EAX，32-bit，通用寄存器，相对于其他寄存器，在进行运算方面比较常用。在保护模式中，也可以作为内存偏移指针（此时，DS作为段寄存器或选择器）。
EBX
EBX，32-bit，通用寄存器。通常作为内存偏移指针使用（相对于EAX、ECX、EDX），DS是默认的段寄存器或选择器。在保护模式中，同样可以起这个作用。
ECX，32-bit，通用寄存器，通常用于特定指令的计数。在保护模式中，也可以作为内存偏移指针（此时，DS作为寄存器或段选择器）。
EDX，32-bit，通用寄存器。在某些运算中作为EAX的溢出寄存器（例如乘、除）。在保护模式中，也可以作为内存偏移指针（此时，DS作为寄存器或段选择器）。
上述寄存器同EAX一样包括对应的16-bit 和8-bit分组
ESI，32-bit，通常在内存操作指令中作为源地址指针使用。当然，ESI可以被装入任意的数制，但通常没有人把它当做通用寄存器来用。DS作为寄存器或段选择器。
EDI，32-bit，通常在内存操作指令中作为目的地址指针使用。
EBP，32-bit，也是作为指针的寄存器。通常，它被高级语言编译器用以建造堆栈帧来保存函数或过程的局部变量。SS是它的默认段寄存器或选择器。
注意，这三个寄存器没有对应的8-bit分组。但可以通过SI、DI，BP分别访问他们的低16位。
6、段寄存器和选择器
实模式下的段寄存器到保护模式下，摇身一变就成了选择器。不同的是，实模式下的段选择器是16-bit的，而保护模式下的选择器是32-bit的。

